{
    "dishes-list": [
        {
            "id": "nanjing-salted-duck",
            "name": "南京盐水鸭",
            "foreign-name": "Nanjing Salted Duck",
            "cuisine-id": "苏菜",
            "description": "南京盐水鸭是南京著名的特产，是金陵菜的代表之一，又叫桂花鸭，是中国地理标志产品。因南京有“金陵”别称，故也称“金陵盐水鸭”，久负盛名，至今已有两千五百多年历史。",
            "core-composion": [
                "鸭子"
            ],
            "secondary-composion": [
                "盐",
                "花椒",
                "八角",
                "葱",
                "姜",
                "料酒"
            ],
            "cooking-methods": [
                "腌",
                "煮"
            ],
            "flavors": [
                "咸鲜"
            ],
            "core-features": [
                "皮白肉嫩",
                "肥而不腻",
                "香鲜味美",
                "具有香、酥、嫩的特点"
            ],
            "cooking-step": [
                "选用肥嫩的新鲜鸭子一只，宰杀治净，去毛、内脏、鸭脚，清洗干净，沥干水分。",
                "用盐和花椒（比例约为100:1）在鸭子内外反复揉搓，进行腌制，尤其要涂抹均匀鸭腔内部。腌制约1-2小时（夏季可缩短，冬季可延长）。",
                "将腌好的鸭子放入清水中浸泡，漂去多余的盐分和花椒粒，然后再次清洗干净，沥干水分。",
                "准备一口足够大的锅，放入洗净的鸭子，加入足量清水，水量需没过鸭子。放入葱结、姜片、八角、料酒。",
                "大火烧开后，撇去浮沫，根据喜好决定是否加盖。改用小火（微火）煮制约30-45分钟（视鸭子大小而定），期间可用勺子舀汤浇淋鸭身，使其入味均匀。",
                "判断鸭子熟透（用筷子插入鸭腿最厚处，无血水流出即熟）后，关火，让鸭子在汤中稍微浸泡一会儿使其更入味。",
                "将煮熟的鸭子捞出，自然晾凉或放入冰水中激一下使其皮更紧致，然后斩件装盘即可食用。"
            ]
        },
        {
            "id": "squirrel-mandarin-fish",
            "name": "松鼠鳜鱼",
            "foreign-name": "Squirrel Mandarin Fish",
            "cuisine-id": "苏菜",
            "description": "松鼠鳜鱼，又名松鼠桂鱼，为苏帮菜中色香味兼具的代表之作。相传清代乾隆皇帝下江南时，曾微服至苏州松鹤楼菜馆用膳，厨师用鲤鱼出骨，在鱼肉上刻花纹，加调味稍腌后，拖上蛋黄糊，入热油锅嫩炸成熟后，浇上熬热的糖醋卤汁，形状似鼠，外脆里嫩，酸甜可口，乾隆皇帝吃后很满意，后名扬苏州。",
            "core-composion": [
                "鳜鱼"
            ],
            "secondary-composion": [
                "虾仁",
                "笋丁",
                "香菇",
                "豌豆",
                "番茄酱",
                "醋",
                "白糖",
                "料酒",
                "盐",
                "淀粉",
                "蒜末"
            ],
            "cooking-methods": [
                "炸",
                "熘"
            ],
            "flavors": [
                "酸甜"
            ],
            "core-features": [
                "形如松鼠",
                "外脆里嫩",
                "色泽橘黄",
                "酸甜适口",
                "有声有色"
            ],
            "cooking-step": [
                "选用新鲜的鳜鱼（或桂鱼）一条，去鳞、鳃、内脏，清洗干净。从鱼唇处下刀，沿着鱼头骨将鱼头切下。从颈部开始，贴着鱼脊骨片下两扇鱼肉。去除鱼腹刺和鱼皮（可选），修掉鱼鳍等部位。",
                "将片下的鱼肉皮朝下平放，用刀斜剞（先剞第一刀，再转45度角剞第二刀），形成类似松鼠毛的花纹，深度至鱼肉厚度的4/5处，注意不要切断。鱼头也需在颌下肉厚处剞几刀。",
                "将剞好花刀的鱼肉和鱼头用少许盐、料酒腌制片刻入味。",
                "调制酥糊：将鸡蛋（主要是蛋黄）打散，加入适量干淀粉（或面粉），调成稠糊状，其浓度以用筷子挑起能呈直线流下为宜。",
                "将腌好的鱼肉和鱼头均匀地拍上一层干淀粉，然后拖上酥糊。",
                "锅中倒入大量食用油，烧至七成热（约170-180℃）。先炸鱼头至定型，捞出。再将鱼肉皮朝下放入油锅，炸至定型翘起，翻面炸至金黄酥脆，捞出沥油。待油温升高后，将鱼头和鱼肉复炸一次，使其更加酥脆，色泽金黄。",
                "将炸好的鱼肉放在盘中拼成松鼠形（鱼头放前端，鱼肉摆成松鼠尾巴状）。",
                "制作糖醋卤汁：锅中留少许底油，放入蒜末爆香，加入番茄酱炒出红油，加入适量清水、白糖、醋、盐，烧开。",
                "用水淀粉勾芡，使卤汁变得浓稠光亮。",
                "将熬好的热卤汁迅速浇淋在拼好形的鱼身上，发出“吱吱”响声，即成。可在旁边点缀焯熟的豌豆、笋丁、香菇丁等配菜。"
            ]
        },
        {
            "id": "lion-head-meatball",
            "name": "清炖蟹粉狮子头",
            "foreign-name": "Lion's Head Meatball",
            "cuisine-id": "苏菜",
            "description": "清炖蟹粉狮子头，又名葵花斩肉，是江苏扬州地区经典传统名菜，为“扬州三头”之一。起源于隋代，唐代因形似狮首得名。",
            "core-composion": [
                "猪肉",
                "蟹肉",
                "蟹黄"
            ],
            "secondary-composion": [
                "青菜心",
                "料酒",
                "盐",
                "葱姜水",
                "淀粉"
            ],
            "cooking-methods": [
                "炖",
                "蒸"
            ],
            "flavors": [
                "咸鲜"
            ],
            "core-features": [
                "形态丰满",
                "肥而不腻",
                "入口即化",
                "青菜酥烂清口",
                "蟹粉鲜香"
            ],
            "cooking-step": [
                "选用肥瘦相间的猪肉（通常肥瘦比约为3:7或4:6），手工剁成粗粒或用绞肉机绞成较粗的肉糜（不宜太细）。",
                "将剁好的肉糜放入盆中，加入适量盐、料酒、葱姜水（葱姜拍碎后加水浸泡而成），顺着一个方向用力搅拌至上劲（感觉肉糜变得粘稠有弹性），再加入少许淀粉（可选）和清水继续搅拌，使肉糜更加嫩滑多汁。",
                "准备好新鲜的蟹粉（蟹肉和蟹黄）。",
                "将调好味的肉糜分成若干份，用手团成大而圆润的丸子（狮子头），大小如橘子。将蟹粉轻轻按入丸子中心或部分包裹在丸子内。",
                "锅中放入垫底菜（通常是大颗青菜心，焯水后垫在砂锅底部，既清口又能吸收荤味），加入适量清水或高汤，水量大约能没过丸子一半即可。",
                "将团好的狮子头轻轻放入锅中（可用手勺辅助，避免弄散形状）。",
                "大火烧开后，撇去浮沫，改用小火（微火）慢炖约2小时，直至丸子熟透、酥软、入味。",
                "临出锅前根据口味加少许盐调味。炖好后连同汤汁和青菜心一同盛入汤碗中即可享用。"
            ]
        }
    ]
}