{
    "dishes-list": [
        {
            "id": "white-cut-chicken",
            "name": "白切鸡",
            "foreign-name": "White Cut Chicken",
            "cuisine-id": "粤菜",
            "description": "白切鸡是粤菜传统名菜之一，起源于清代广东民间，因烹鸡时不加调味白煮而成，食用时随吃随斩，故又称“白斩鸡”。其特点是制作简易，刚熟不烂，不加配料且保持原味。",
            "core-composion": [
                "三黄鸡"
            ],
            "secondary-composion": [
                "姜",
                "葱",
                "沙姜",
                "花生油",
                "盐"
            ],
            "cooking-methods": [
                "煮",
                "浸"
            ],
            "flavors": [
                "鲜香",
                "清淡"
            ],
            "core-features": [
                "皮爽肉滑",
                "肉质鲜嫩",
                "原汁原味",
                "骨髓带血"
            ],
            "cooking-step": [
                "选用肥嫩的三黄鸡，宰杀治净，去除内脏、鸡肺、鸡油等（可保留部分鸡油增加香味），清洗干净，沥干水分。",
                "准备一大锅清水，水量需能完全淹没整只鸡。",
                "将处理干净的鸡放入沸水中，提起鸡头让鸡身浸入热水中烫约10秒，然后提出，再放入，如此重复三次（俗称“三提三放”），目的是让鸡皮收紧，定型。",
                "之后将鸡完全浸入锅中，改用小火（或微火）保持水温在90℃左右，似滚非滚状态浸煮。期间可用勺子舀热水淋在鸡身上，确保受热均匀。",
                "根据鸡的大小浸煮约15-25分钟（可用筷子插入鸡腿最厚处，无血水流出即熟）。",
                "判断鸡肉刚好熟透后，立即将鸡捞起，放入预先准备好的冰水或冷开水中迅速冷却（过冷河），使鸡皮爽脆，肉质紧实。",
                "冷却后将鸡捞起，控干水分，斩件装盘。",
                "将姜切成细茸，葱切粒，沙姜切茸（可选），分别用热花生油激发出香味，加入适量盐调味，制成姜葱蓉蘸碟。食用时蘸食即可。"
            ]
        },
        {
            "id": "roast-suckling-pig",
            "name": "烤乳猪",
            "foreign-name": "Roast Suckling Pig",
            "cuisine-id": "粤菜",
            "description": "烤乳猪是广东广州最著名的特色菜，被誉为“满汉全席”中的主要菜肴。早在西周时此菜已被列为“八珍”之一，清代时成为宫廷名菜，后传至各地。",
            "core-composion": [
                "乳猪"
            ],
            "secondary-composion": [
                "五香粉",
                "白糖",
                "食盐",
                "酱油",
                "芝麻酱",
                "南乳",
                "麦芽糖",
                "白醋",
                "料酒"
            ],
            "cooking-methods": [
                "烤"
            ],
            "flavors": [
                "咸香",
                "酥脆"
            ],
            "core-features": [
                "色泽大红",
                "皮脆肉嫩",
                "入口即化",
                "肥而不腻"
            ],
            "cooking-step": [
                "选用约4-6公斤重的健康乳猪一只，宰杀后煺毛，从腹部剖开，去除内脏、猪脑、气管、喉管等，清洗干净，沥干水分。",
                "用五香粉、盐、酱油、料酒等调料涂抹猪腔内部进行腌制，腌制约1小时入味。",
                "用铁钩挂起乳猪，用沸水淋遍猪皮表面，使毛孔收缩，皮层紧密，然后用冷水冲凉。",
                "调制脆皮水：将麦芽糖、白醋、少许料酒混合，搅拌均匀至糖溶解（比例约为麦芽糖:白醋 = 1:1 或 2:1）。",
                "用刷子将调好的脆皮水均匀地刷在乳猪的外皮上，晾干（一般需要数小时甚至过夜，确保表皮完全干燥）。",
                "将处理好的乳猪用木条或竹签撑开猪腔，固定形状，便于受热均匀。",
                "将烤炉预热至适宜温度（传统炭炉或现代烤箱均可，温度控制很关键，通常先高温后中低温）。",
                "将乳猪挂入烤炉，先用较高温度烤制一段时间使表皮上色并定型，然后降低温度，持续烤制，期间可能需要多次转动猪身使其受热均匀。",
                "烤制过程中，观察猪皮颜色变化，当猪皮呈现大红色，表面起泡酥脆，敲击有清脆声时，表示基本烤好。",
                "出炉后稍凉片刻，将乳猪斩件装盘即可享用。"
            ]
        },
        {
            "id": "shrimp-dumplings",
            "name": "虾饺",
            "foreign-name": "Shrimp Dumplings",
            "cuisine-id": "粤菜",
            "description": "虾饺是广东省广州市的一种特色小吃，是广东茶楼、酒家的传统美点。由上世纪20年代广州市河南区伍村伍凤乡的一间家庭式小茶楼所创，后经发展成为粤点之王。",
            "core-composion": [
                "鲜虾",
                "澄粉"
            ],
            "secondary-composion": [
                "猪肥肉",
                "笋丝",
                "猪油",
                "盐",
                "白糖",
                "味精",
                "芝麻油",
                "胡椒粉"
            ],
            "cooking-methods": [
                "蒸"
            ],
            "flavors": [
                "鲜甜"
            ],
            "core-features": [
                "皮薄如纸",
                "半透明",
                "馅料鲜美",
                "形态精致"
            ],
            "cooking-step": [
                "制作虾饺皮：将澄粉和玉米淀粉（或其他淀粉）混合，用刚烧开的沸水烫面，边烫边搅拌，然后趁热揉成光滑的面团，盖上湿布或保鲜膜防止表面风干。稍凉后加入少量猪油揉匀，搓成长条，摘成小剂子，压扁擀成中间厚边缘薄的圆形薄皮（要求非常薄且有韧性）。",
                "制作虾饺馅：将新鲜虾仁洗净吸干水分，挑去泥肠，一部分剁成泥，一部分切成小粒（保持口感层次），混合在一起。加入切碎的猪肥肉粒（增加口感和香味）、笋丝（可选），以及盐、白糖、味精、芝麻油、胡椒粉等调料拌匀，顺着一个方向搅打至上劲（如有冰水可分次加入，使馅料更爽脆多汁）。",
                "包制虾饺：取一张擀好的虾饺皮，放入适量馅料（不要太多以免破皮），按照传统的捏褶手法（如十三褶）将饺子封口，要求收口严密，形态美观（如梳子状）。",
                "蒸制：在蒸笼内垫上蒸笼纸或刷上一层油防粘。将包好的虾饺整齐地摆放在蒸笼里，注意留出空隙。",
                "将蒸锅里的水烧开，放入蒸笼，用大火蒸制约6-8分钟（具体时间看虾饺大小），至虾饺皮呈半透明状，能清晰看到里面的红色虾仁即可。",
                "迅速取出，趁热食用，以保证皮的爽滑和馅的鲜美。"
            ]
        }
    ]
}